{
	"code": "1234",
	"levels": "P",
	"uen": " T07GS1234G",
	"logo": "./Medias/Images/Schools/logos/tn_1234.jpg",
	"name": "Balestier Hill Primary School",
	"website": "http://www.balestierhillpri.moe.edu.sg",
	"address": "565, Balestier Road (329927)",
	"telephone": [
		"63539451"
	],
	"fax": [
		"62546150"
	],
	"email": "bhps@moe.edu.sg",
	"mrt": [
		"Toa Payoh MRT",
		"Novena MRT"
	],
	"bus": "21 , 129 , 130 , 131 , 139 , 145 , 186 ",
	"GeneralInformation": {
		"Principal": "Miss Tan Chay Eng",
		"Vice Principal": [
			"Mr Lim Kay Wah Benedict",
			"Mrs Santhi Ravindran"
		],
		"School Vision": "Active Learners,                  Dynamic Leaders and                                    Enterprising Citizens",
		"School Mission": "A vibrant community that maximizes the potential of every individual.",
		"School Philosophy, Culture and Ethos": "We are guided by our philosophy that every child can learn and succeed. In our efforts to nurture the children entrusted in our care, we offer a student-centric, values-driven education that helps our students to enjoy coming to school, pursue their passions and succeed. We focus on every child and value their special talents, abilities, interests and learning needs. Through the learning experiences in our school, all our students will develop into Active learners(students who are always learning and doing their best in any situation), Dynamic leaders (Not just leaders but useful people in their own right who contribute to making a difference in all they do) and Enterprising citizens (be socially responsible people making Singapore proud. Have a global perspective and be outward looking.)  All Balesterians are guided by the 5 core values embedded in the acronym HELIX: Honour being our hallmark, Resilience our spirit, Love our culture, Innovation our anchor and, eXcellence our commitment. Just like the double helix in the DNA of our cells, the Core values define our school and are the foundation values for every child in the school.  They will guide the child daily and be the moral compass in his/her decision-making process.    The school Motto is our Acronym BHPS; Believing, Harnessing, Progressing, Surpassing. The school strongly believes in continuously improving ourselves so that we will surpass our own expectations and potential.   We believe strongly in innovation and the school theme \"New Ideas; Infinite Possibilities\" signals to everyone that innovation is a key skill to develop if we want our students to excel in the new uncertain and globalized world. Our students need to learn to be resilient and adaptable to seize opportunities for success.",
		"Type of School": "Government School / Co-ed School / Single Session",
		"Mother Tongue": "Chinese / Malay / Tamil",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [
		"Art",
		"Chinese",
		"Civics & Moral Education",
		"Co-curricular Activities",
		"English Language",
		"Foundation English",
		"Foundation Mathematics",
		"Health Education",
		"Higher Chinese",
		"Higher Malay",
		"Higher Tamil",
		"Malay",
		"Mathematics",
		"Music",
		"Physical Education",
		"Science",
		"Social Studies",
		"Tamil"
	],
	"Cca": {
		"Physical Sports": [
			"Floorball",
			"Track & Field",
			"Wushu"
		],
		"Uniformed Groups": [
			"Boys' Brigade",
			"Girls' Brigade"
		],
		"Visual and Performing Arts": [
			"Artland",
			"Dance Circle"
		],
		"Clubs & Societies": [
			"Friends Of Gaia",
			"Technoland"
		]
	},
	"SpecialProgrammes": {
		"School Distinctive Programmes": {
			"Sports & Outdoor Education": "The ALTOS Experience @ BHPS (Active Learning Through Outdoor Activities and Sports at Balestier Hill Primary School)"
		},
		"Special Student Development Programmes Offered": "Learning for Life Programme- The ALTOS Experience @ BHPS The ALTOS(Active Learning Through Outdoors and Sports) Experience @ BHPS is our LLP programme intended to develop students' character and acquisition of 21st Century competencies by providing experiential learning opportunities through various sports and the outdoor activities. Our vision is that our students learn the skills and imbued with lifeskills like adaptability, resilience, teamwork and self-confidence and apply them to their academic work and future jobs.   The LLP leverages existing school curriculum and co-curriculum programmes to enhance the broad based development of students' learning in Sports, Outdoor Education and Environment Appreciation. At each level, the learning of skills and knowledge is progressive and students are provided opportunities to revisit, make connections and extend their learning. The learning objectives will be spiral in nature  spanning over 6 years.  BHPS-Connect In the age of seamless connectivity and focus on STEM(Science, Technology, Engineering and Mathematics), we aim to develop IT-savy students who are independent learners. The school leverages strongly on ICT in our curriculum, harnessing the power of web2.0. We have sufficient mobile devices so that our students can take their learning beyond the classroom and have an authentic experience. Our rigorous 6 year ICT programme includes \"Let's Decode\", basic robotics, 10'CMT and creation of bitstrip and 3D printing in Art.  Fins 'N' Claws Programme  The Fins \"N\" Claws Tavern is an Aquatic Ecosystem Learning Centre that uses the concept of \"environment as the third teacher\" and harnesses technology using tablets to provide students with opportunities for self-directed learning as they collaborate with one another. Apart from developing 21st Century competencies, National Education is also inculcated in the students as they learn first- hand that Singapore can be self-sustaining in the area of food production."
	},
	"AchievementHistory": {
		"Primary": {
			"2014": {
				"Development Award": [
					"DA (Character Development)",
					"DA (National Education)"
				]
			},
			"2015": {
				"Development Award": [
					"DA (Character Development)",
					"DA (National Education)"
				]
			},
			"2016": {
				"Development Award": [
					"DA (Character Development)",
					"DA (National Education)"
				]
			},
			"Sports & Games Competition": [
				{
					"year": "2014",
					"category": "Track & Field",
					"subCategory": [
						"National",
						"Girls",
						"'A' Div"
					],
					"award": "4th"
				},
				{
					"year": "2015",
					"category": "Track & Field",
					"subCategory": [
						"National",
						"Boys",
						"'A' Div"
					],
					"award": "1st"
				}
			],
			"SYF": [
				{
					"year": "2014",
					"category": "Art - Category B",
					"award": "Recognition"
				},
				{
					"year": "2014",
					"category": "Dance - International",
					"award": "Accomplishment"
				},
				{
					"year": "2015",
					"category": "Art - Category A",
					"award": "Recognition"
				},
				{
					"year": "2015",
					"category": "Dance - International",
					"award": "Accomplishment"
				},
				{
					"year": "2016",
					"category": "Art - Category A",
					"award": "Recognition"
				},
				{
					"year": "2016",
					"category": "Dance - International",
					"award": "Accomplishment"
				},
				{
					"year": "2016",
					"category": "Ensemble - Harmonica",
					"award": "Accomplishment"
				}
			],
			"Best Unit Award": [
				{
					"year": "2014",
					"category": "Boys' Brigade",
					"award": "Silver"
				},
				{
					"year": "2014",
					"category": "Girls' Brigade",
					"award": "Gold"
				},
				{
					"year": "2015",
					"category": "Boys' Brigade",
					"award": "Silver"
				},
				{
					"year": "2015",
					"category": "Girls' Brigade",
					"award": "Gold"
				},
				{
					"year": "2016",
					"category": "Boys' Brigade",
					"award": "Gold"
				},
				{
					"year": "2016",
					"category": "Girls' Brigade",
					"award": "Gold"
				}
			]
		}
	},
	"postalCode": "329927",
	"coordinates": [
		103.844311132,
		1.32581675255
	],
	"svy21": [
		29223.36,
		34227.6
	],
	"planningArea": "NV",
	"neighbours": [
		"BT",
		"KL",
		"CC",
		"TN",
		"TP",
		"CA"
	],
	"specialNeeds": [
		"PD",
		"Mild SEN"
	],
	"studentCare": true,
	"id": "1234"
}