{
	"code": "1266",
	"name": "Alexandra Primary School",
	"levels": "P",
	"uen": " T13GS0002K",
	"logo": "./Medias/Images/Schools/logos/tn_1266.jpg",
	"website": "http://alexandrapri.moe.edu.sg",
	"address": "2a, Prince Charles Crescent (159016)",
	"telephone": [
		"62485400"
	],
	"fax": [
		"62485409"
	],
	"email": "alexandra_ps@moe.edu.sg",
	"mrt": [
		"Tiong Bahru MRT",
		"Redhill MRT"
	],
	"bus": "51 , 139 , 186 , 970. ",
	"GeneralInformation": {
		"Principal": "Mdm Chew Bee Lay",
		"Vice Principal": [
			"Miss Chan Yan Hoon",
			"Mdm Noraini Bte Mansoor"
		],
		"School Vision": "Reflective Learner, Empathic Designer and Inspiring Leader.",
		"School Mission": "We create a caring, safe and stimulating school environment where each child can grow and glow.  We seek to build in our students a strong foundation in literacy and numeracy, as well as equip them with the attitude, values and 21st century skills to be future-ready and to engage the world while remaining rooted to Singapore.",
		"School Philosophy, Culture and Ethos": "Every child matters, is unique, and has the potential to make a difference.   Every staff member is an asset, has different strengths, and wants to contribute. Every parent and community partner is a valuable contributor in nurturing the child to G.L.O.W.  We believe that all children can learn and be successful, and that they learn best when they are connected, cared for, and cherished.  By providing them with a strong foundation in literacy and numeracy, and inculcating in each child the right attitudes, values, as well as equipping them with the 21st century competencies,  they can become creative problem-solvers, articulate communicators, effective team players, life-long learners, and responsible citizens committed to the well-being of Singapore and fellow Singaporeans.  This is realised through the collaborative efforts of the school, parents, and community partners.  Our HER3OIC Values Harmony, Empathy, Resilience, Respect, Responsibility, Optimism, Integrity & Creativity",
		"Type of School": "Government School / Co-ed School / Single Session",
		"Mother Tongue": "Chinese / Malay / Tamil",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [
		"Art",
		"Chinese",
		"English Language",
		"Health Education",
		"Malay",
		"Mathematics",
		"Music",
		"Physical Education",
		"Science",
		"Social Studies",
		"Tamil"
	],
	"Cca": {
		"Physical Sports": [
			"Badminton",
			"Rugby",
			"Softball",
			"Tchoukball"
		],
		"Visual and Performing Arts": [
			"Art And Craft Club",
			"Choir",
			"Dance - International"
		],
		"Clubs & Societies": [
			"Cheerleading Club",
			"Chess Club",
			"Environmental Club",
			"Media Resource And It Club"
		]
	},
	"SpecialProgrammes": {
		"School Distinctive Programmes": {
			"Community Service & Student Leadership": "Cultural Intelligence (CQ) ─ The Code of Life"
		},
		"Special Student Development Programmes Offered": "Lifeskills@ALPS Students are taught the ALPS HER3OIC values, and Character Champions are identified and recognised with inputs from peers and teachers. The school adopts evidence-based principles such as breathing exercises and focused attention to help students regulate their emotions and raise their self-awareness as well as awareness of the people and things around them.  Student Leadership Development All students are given opportunity to lead in pledge-taking at morning assemblies. The Class Committee allows all students to be responsible for an area in class.  ALPS Ambassadors are trained to play host to visitors at school events.  ALPS Environmental Programme This aims to develop responsible citizens with an ecological conscience.  It inculcates in students awareness of environmental issues and the part they can play, including a commitment to \"always leave a place cleaner than before\" through actions like daily cleaning of canteen and classrooms.  Students also assume responsibility to educate their families about environmental conservation.  ALPS Toymaker This teaches children to find joy in a toy they make themselves using simple or recycled materials.  It also raises awareness of the scientific principles behind how toys work.  The ALPS Toymaker Card guides students in designing, making and explaining  how their toy works.  Shortlisted projects are submitted for the Sony Creative Science Award.  Design Thinking as a Way of Life The focus is on laying the attitude and values foundation for DT, in particular, empathy, collaboration, optimism, respect and resilience.  This is carried out through the Lifeskills@ALPS and complemented by the Little Designers Programme and the Design for Change Challenge where students work in teams to identify the needs within the school and community and create solutions for them."
	},
	"AchievementHistory": {
		"Primary": {
			"Sports & Games Competition": [],
			"SYF": [
				{
					"year": "2015",
					"category": "Art - Category A",
					"award": "Recognition"
				},
				{
					"year": "2016",
					"category": "Art - Category A",
					"award": "Recognition"
				}
			],
			"Best Unit Award": []
		}
	},
	"postalCode": "159016",
	"coordinates": [
		103.824119668,
		1.29133448213
	],
	"svy21": [
		26976.2403,
		30414.7271
	],
	"planningArea": "BM",
	"neighbours": [
		"QT",
		"TN",
		"SI",
		"CA"
	],
	"specialNeeds": [
		"PD",
		"Mild SEN"
	],
	"studentCare": true,
	"p1Registration": {
		"Total Vacancy": 210,
		"Vacancies Reserved for Phase 2B and 2C": 40,
		"Vacancy for Phase 1": 170,
		"No. of Applicants in Phase 1": 82,
		"Places taken up to Phase 1": 82,
		"Vacancy for Phase 2A1": 88,
		"No. of Applicants in Phase 2A1": 0,
		"Places taken up to Phase 2A1": 81,
		"Vacancy for Phase 2A2": 89,
		"No. of Applicants in Phase 2A2": 0,
		"Places taken up to Phase 2A2": 81,
		"Vacancy for Phase 2B": 65,
		"No. of Applicants in Phase 2B": 2,
		"Places taken up to Phase 2B": 83,
		"Vacancy for Phase 2C": 127,
		"No. of Applicants in Phase 2C": 161,
		"Places taken up to Phase 2C": 210
	},
	"id": "1266"
}