{
	"code": "1269",
	"levels": "P",
	"uen": " T15GS0006D",
	"logo": "./Medias/Images/Schools/logos/tn_1269.jpg",
	"name": "Punggol Cove Primary School",
	"website": "http://www.punggolcovepri.moe.edu.sg/",
	"address": "52, Sumang Walk (828674)",
	"telephone": [
		"63857339"
	],
	"fax": [
		"63857261"
	],
	"email": "punggolcove_ps@moe.edu.sg",
	"mrt": [],
	"GeneralInformation": {
		"Principal": "Mr Yap Swee Beng, Dennis",
		"Vice Principal": "Miss Thia Hwei Ling Sharon",
		"School Vision": "Every student an educated child and contributing citizen, ready to serve and lead.",
		"School Mission": "Nurturing the Whole Child, Growing Future Leaders",
		"School Philosophy, Culture and Ethos": "Value: Empathy   Characteristics and Practices of Empathy: 1) Appreciates the perspective of others, always see where others are coming from and seek consensus. Do not reject a person based on differences or biasness.  2) Listens and seeks to understand, practise listening to understand others. Seek to understand before seeking to be understood.  Value: Mindfulness  Characteristics and Practices of Mindfulness: 1) Having self and social awareness. Understand who we are and our impact on others. Understand what we are good at and how we can make use of it to serve others.  2) Has the ability to appreciate beauty in the aesthetics and the environment. Knowing how to appreciate music, art and the environment. Knowing how to take care of the physical environment.  3) Is able to organise thoughts and information meaningfully before acting. Putting thoughts and information together coherently and meaningfully to derive knowledge and wisdom for action before acting. Stop. Think. Do.  4) Able to anticipate. Seeing what is happening around us and remembering events of the past to anticipate future opportunities and threats.  Value: Care  Characteristics and Practices of Care: 1) Has the ability to take care of self and others. Knowing how to take care of one's health and physical development. Being conscious in caring for others. Knowing how to be safe.  2) Believes in contributing to, caring for and serving the family and community. Identify and attend to each other's needs at home, in school and the community. Building a school community that serves with care.  3) Able to convince and win others over. Using sound reasons to convince others of our proposition. An approach that does not run-down others. Helping others to see the larger good and meeting the needs of and caring for the larger community.",
		"Type of School": "Government School / Co-ed School / Single Session",
		"Mother Tongue": "Chinese / Malay / Tamil",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [],
	"Cca": {},
	"SpecialProgrammes": {
		"Special Student Development Programmes Offered": "Holistic English Literacy Program (HELP)  We envision every student to be an educated child and a contributing citizen, ready to serve and lead. In line with this vision, the English department has anchored a distinctive program, Holistic English Literacy Program (HELP) with the intent of imparting language skills to our students so that they feel empowered to use these skills in their community service learning projects.   To enable learners to emerge as effective leaders in their own right, we strive on fostering a learning environment that extends far beyond the classroom walls. This \"service learning\" acts as a catalyst in enhancing both, student growth and the common good. Most importantly, it recognises the need to engage pupils in a natural learning process that is real and purpose driven. The underpinning belief in the development of this program is that children will be motivated to learn if they are presented with a strong purpose to do so.  Purposefully crafted activities intend to help young people acquire the skills, attitudes, and beliefs that fully engage them in community life and help them move from the periphery of their community to its center.  We believe that an emphasis on the public good challenges young minds to identify needs and strengths,  both in themselves and their community and to find creative ways for improving community conditions. HELP serves as an avenue to fulfil our school's vision of being a place where all students engage in learning, achieve to the best of their ability, and become productive citizens and participants of the community."
	},
	"AchievementHistory": {
		"Primary": {
			"Sports & Games Competition": [],
			"SYF": [],
			"Best Unit Award": []
		}
	},
	"postalCode": "828674",
	"coordinates": [
		103.89880462,
		1.41159891867
	],
	"svy21": [
		35287.6769,
		43713.0551
	],
	"planningArea": "PG",
	"neighbours": [
		"PR",
		"SL",
		"SE"
	],
	"specialNeeds": [
		"PD",
		"Mild SEN"
	],
	"studentCare": true,
	"p1Registration": {
		"Total Vacancy": 300,
		"Vacancies Reserved for Phase 2B and 2C": 40,
		"Vacancy for Phase 1": 260,
		"No. of Applicants in Phase 1": 38,
		"Places taken up to Phase 1": 38,
		"Vacancy for Phase 2A1": 222,
		"No. of Applicants in Phase 2A1": 0,
		"Places taken up to Phase 2A1": 38,
		"Vacancy for Phase 2A2": 222,
		"No. of Applicants in Phase 2A2": 1,
		"Places taken up to Phase 2A2": 39,
		"Vacancy For Phase 2B": 131,
		"Vacancy for Phase 2B": 131,
		"No. of Applicants in Phase 2B": 0,
		"Places taken up to Phase 2B": 39,
		"Vacancy for Phase 2C": 261,
		"No. of Applicants in Phase 2C": 144
	},
	"id": "1269"
}