{
	"code": "1256",
	"levels": "P",
	"uen": " T10GS0001K",
	"logo": "./Medias/Images/Schools/logos/tn_1256.jpg",
	"name": "CANTONMENT PRIMARY SCHOOL",
	"website": "http://www.cantonmentpri.moe.edu.sg",
	"address": "1, Cantonment Close ( 088256 )",
	"telephone": [
		"65119555"
	],
	"fax": [
		"65119556"
	],
	"email": "cantonment_ps@moe.edu.sg",
	"mrt": "Tanjong Pagar Outram",
	"GeneralInformation": {
		"Principal": "MDM WONG MEI FOONG",
		"Vice Principal": "MISS SABARIAH BTE SUBARI",
		"School Vision": "Concerned citizens, innovative thinkers, inspired for excellence, service and influence",
		"School Mission": "To nurture and empower our students to realise their potential and aspirations so as to have a positive and significant impact in the school and community",
		"School Philosophy, Culture and Ethos": "Cantonment Primary School believes that a student's holistic growth begins from a caring and collaborative school culture and tone. Cultivating this culture and tone is each staff member's responsibility and is demonstrated in the different facets of the school's curriculum deliveries; in how lessons are planned, how learning is shared, how safety is managed, how discipline is enforced and how relationships and partnerships are built. We also believe that a caring and collaborative culture does not compromise on the high academic standards and rigor expected. On the contrary; because a caring culture is about accountability for the students' academic performance, accountability to address the varied student needs, and accountability for the quality of programs offered, and because a collaborative culture is about progressing sharper learning with the help of others and vice versa.  A caring culture is the base from which we develop students who are \"Concerned citizens, Innovative Thinkers, Inspired for Excellence, Service and Influence\" as articulated in our school vision. In the course of their six-year journey, we hope that our students strengthen the caring culture in how they conduct themselves as a member of the school and community and in what they accomplish for self and for school.  We believe that every child has the propensity to be persons of good character. We believe that every child should be given the opportunity to serve and lead others. We believe that the home, school and community play equally important roles in shaping the child. This last belief is the critical collaboration that we work towards in our mission goals.",
		"Type of School": "GOVERNMENT SCHOOL / CO-ED SCHOOL / SINGLE SESSION",
		"Mother Tongue": "Chinese / Malay / Tamil",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [],
	"Cca": {
		"Physical Sports": [
			"Badminton",
			"Football",
			"Hockey"
		],
		"Visual and Performing Arts": [
			"Dance - International"
		],
		"Clubs & Societies": [
			"Infocom/Robotics Club"
		]
	},
	"SpecialProgrammes": {
		"MOE Programmes": [
			"Not Available"
		],
		"School Distinctive Programmes": {
			"Interdisciplinary": "TC@CPS"
		},
		"Special Student Development Programmes Offered": "The CPS vision is to nurture 'Concerned Citizens, Innovative Thinkers, Inspired for Service, Excellence and Influence'. This future oriented vision recognises that our students need to possess skills, aptitudes and attitudes in order to succeed and contribute in the 21st century. The school's Applied Learning Programme, a Thinking Curriculum @ Cantonment Primary School (TC@CPS) is to develop and encourage 'Innovative Thinkers' through a school wide approach.   TC@CPS identifies specific higher order thinking skills for each level,  to give better structure and form in teaching these skills eg. to 'create' at P5 and P6. Different strategies are adopted suited for the different subjects. To give a common language for discourse all teachers are trained in the 'Visible Thinking' approach through an on-line course by the Harvard Graduate School of Education. Students use the thinking strategies in the classrooms to learn about subject content. There are four levels of programmes that offer scope and depth for learning and practice. The first is at the classroom level, the second through school wide activities beyond the classroom, the third for students with specific inclinations and the fourth in external competitions and platforms. TC@CPS is to cultivate responsible and independent thinkers who will contribute positively to the community.  Our efforts to encourage concerned citizenship is also through our anchor Values Education (VE) lessons and activities; a key vehicle for achieving the Character and Citizenship Education intents and goals. VE is similarly school-wide and tiered by design. Adopting the Head (understanding the values) Hand (the authentic experience) and Heart (critical personal reflection) approach, VE heightens realisation of the roles our students can play and the contributions they can make."
	},
	"AchievementHistory": {
		"Primary": {
			"2014": {
				"SYF Arts Presentation": {
					"Dance - International": "Accomplishment"
				}
			},
			"2015": {
				"SYF Arts Presentation": {
					"Art - Category C": "Recognition",
					"Dance - International": "Accomplishment"
				}
			},
			"2016": {
				"SYF Arts Presentation": {
					"Art - Category C": "Recognition",
					"Dance - International": "Accomplishment",
					"Ensemble - Guitar": "Commendation"
				}
			},
			"2017": {}
		}
	},
	"postalCode": "088256"
}