{
	"code": "1260",
	"name": "PUNGGOL VIEW PRIMARY SCHOOL",
	"levels": "P",
	"uen": " T12GS0003A",
	"logo": "./Medias/Images/Schools/logos/tn_1260.jpg",
	"website": "http://www.punggolviewpri.moe.edu.sg",
	"address": "9, Punggol Place ( 828845 )",
	"telephone": [
		"6570 1588"
	],
	"fax": [
		"6570 3680"
	],
	"email": "punggolview_ps@moe.edu.sg",
	"mrt": "Punggol MRT Station",
	"bus": "50 382",
	"GeneralInformation": {
		"Principal": "MR TAY HSIEN CHUAN KELVIN",
		"Vice Principal": "MR CHUA CHYE HOCK",
		"Vice Principal (Admin)": "MDM LAI SOO HONG",
		"School Vision": "Confident Learners, Active Citizens After 6 years in Punggol View, we want our students to become confident learenrs and active citizens.   A Confident Learner is  -Cognitively robust  -Aesthetically aware -Physically active  An Active Citizen is  -Morally upright -Emotionally adept -Socially responsible  We want our students to strive to \"Do the Right Thing\" and\"Give of their Best\" for future learning, employment and citizenship.",
		"School Mission": "Touching Lives, Inspiring Future To nurture the whole child through a values-based, holistic education in a caring and rich learning environment so that our students will become persons of character who are good and useful citizens of tomorrow.   We want to provide strong fundamentals for Future Learning that includes: - Nurturing sound values and social-emotional skills to develop character. - Develop the love for Singapore for active citizenry. - Building foundations in literacy, numeracy, scientific and life skills for the 21st Century learning, employment and citizenship.",
		"School Philosophy, Culture and Ethos": "We adopt the Starfish Story as our philosophy to guide us to make a difference in the lives of our students, staff and stakeholders.  Our motto \"Grow and Glow\" is an aspiration that as the school grows, it will glow in the community as a school of distinction.    We believe in nurturing the whole child by guiding our students to develop their moral, emotional, social, cognitive, aesthetic and physical (MESCAP) domains to the fullest so that they will become persons of character who are good and useful citizens of tomorrow.  We want our students to:    - Learn the subject disciplines comprising the Languages, Social Studies, the Arts and Physical Education, Mathematics and Science so as to build a strong foundation in literacy, numeracy, scientific and life skills for the future,   - Inculcate and cultivate values and social-emotional skills to develop moral character,   - Foster the emerging 21st Century Competencies so as to develop performance character, and   - Enrich our students' learning experiences especially in the areas of creativity, outdoor education, student leadership and talent development so as to meet their diverse needs and interests, and to realise their full potential.  We believe that we can do so by building a culture of care and learning in the school.  We provide a caring climate for our students to grow through positive teacher-student relationship and restorative practice to manage good behaviour and peer relationship.  We design a rigorous and sound school-based curriculum to foster the joy of learning and the drive for lifelong learning.  To further develop our students' talent and interest, our students are provided opportunities to experience the following key programmes, namely, creativity and play-based learning, outdoor education, and student life and leadership programme.  We will need to: (1) enhance our staff capacity and well-being and (2) collaborate with the home and community to bring out the best in every student.",
		"Type of School": "GOVERNMENT SCHOOL / CO-ED SCHOOL / SINGLE SESSION",
		"Mother Tongue": "Chinese / Malay / Tamil",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [
		"ART",
		"CHINESE",
		"ENGLISH LANGUAGE",
		"MALAY",
		"MATHEMATICS",
		"MUSIC",
		"PHYSICAL EDUCATION",
		"SCIENCE",
		"SOCIAL STUDIES",
		"TAMIL"
	],
	"Cca": {
		"Physical Sports": [
			"Badminton",
			"Floorball",
			"Sports & Adventure Club",
			"Wushu"
		],
		"Uniformed Groups": [
			"Scouts"
		],
		"Visual and Performing Arts": [
			"Choir",
			"Dance - International",
			"Young Artist's Club"
		],
		"Clubs & Societies": [
			"Service & Interact Club"
		]
	},
	"SpecialProgrammes": {
		"MOE Programmes": [
			"Not Available"
		],
		"School Distinctive Programmes": {
			"Sports & Outdoor Education": "Building Character through Outdoor Education"
		},
		"Special Student Development Programmes Offered": "Living Out our Values Every day (LOVE@PGVP) We believe that values are caught and not just taught. The school values are taught during our Character and Citizenship Education (CCE) Lessons and reinforced through our school-based programmes.  Students are taught to reflect on their actions on a Value Card and teachers will endorse the card upon the successful completion of the observable behaviours or actions. The students could be rewarded with a value badge. We hope by so doing, our students will live out these values as habits for life  Learning for Life Programme - Outdoor Education   We believe firmly that Outdoor Education (OE) is a good opportunity to develop ruggedness and resilience in our students. Hence, the school has put in place a comprehensive Learning for Life Programme (LLP) on Outdoor Education. This allows students to work in teams and collaborate with their peers to build character, evoke their curiosity about nature, and develop a feeling of wanting to protect the environment via Values in Action. In the process, our students will learn to navigate, assess risks and make decisions about their own safety and wellbeing, while enjoying the outdoors.  These are essential life skills and values that we hope to develop in our students.   Creative LEGO Our signature Creative LEGO ensures that our students acquire the learning outcomes of Confidence, Curiosity and Collaboration through a series of art-related experiences such as PAL. Students will acquire an appreciation for sculpture building as well as develop skills in aesthetics and creativity.  Through generating ideas creatively in groups and responding to issues and challenges, our students would develop 21st century competencies such as collaboration and communicating effectively.  Most importantly, our students will enjoy the learning through active engagement with the element of fun."
	},
	"AchievementHistory": {
		"Primary": {
			"2005": {},
			"2006": {},
			"2007": {},
			"2008": {},
			"2009": {},
			"2010": {},
			"2011": {},
			"2012": {},
			"2013": {},
			"2014": {},
			"2015": {
				"SYF Arts Presentation": {
					"Art - Category B": "Recognition"
				}
			},
			"2016": {
				"SYF Arts Presentation": {
					"Art - Category B": "Recognition",
					"Dance - International": "Accomplishment"
				},
				"Best Unit Award": {
					"Scout": "Bronze"
				}
			},
			"2017": {}
		}
	},
	"postalCode": "828845"
}