{
	"code": "1270",
	"name": "OASIS PRIMARY SCHOOL",
	"levels": "P",
	"uen": " T15GS0007L",
	"logo": "./Medias/Images/Schools/logos/tn_1270.jpg",
	"website": "http://www.oasispri.moe.edu.sg/",
	"address": "71, Edgefield Plains ( 828716 )",
	"telephone": [
		"6320 9855"
	],
	"fax": [
		"6320 9856"
	],
	"email": "oasis_ps@moe.edu.sg",
	"mrt": "Damai LRT Station",
	"bus": "50 , 386 ",
	"GeneralInformation": {
		"Principal": "MRS ONG-CHEW LU SEE",
		"Vice Principal": "MDM NG YIN SZE JOSEPHINE",
		"Vice Principal (Admin)": "MR NG CHU SIU",
		"School Vision": "Passionate Learners, Caring Leaders",
		"School Mission": "To build a community of learners - Inspiring self and others to lead with a heart",
		"School Philosophy, Culture and Ethos": [
			"Oasis Primary School (OPS) believes that every child can learn and achieve when their needs, interests and abilities are looked into.  We are committed to provide quality education for all children so that they can develop holistically in their moral, emotional, social, cognitive, aesthetic and physical domains and become \"Passionate Learners, Caring Leaders\", children who are capable of learning and innovating continuously. More importantly, they are able to take good care of themselves, their families and the less-privileged, and in turn, contribute back to the society that has nurtured them.",
			"The name of the school conjures up an image of a sanctuary where one can find safety and sustenance that provides an experience that is challenging and enriching. It evolves around building an oasis within a trying environment (desert) where innovations, strengths and positive attributes are necessary to overcome adversities. ",
			"Beyond equipping the students with an excellent foundation in literacy and numeracy, the school's programmes will also help them to acquire skills, instincts and competencies to traverse the \"desert\" of tomorrow. The focus will be on processes and skills for the 21st century, in particular communication and teamwork, collaboration, creative problem-solving, cultural intelligence and critical thinking. In OPS, we will engage the parents and together with our teachers, concerted efforts will be made to inculcate the R3ICH (Respect, Responsibility, Resilience, Integrity, Care and Harmony) values among the students."
		],
		"Type of School": "GOVERNMENT SCHOOL / CO-ED SCHOOL / SINGLE SESSION",
		"Mother Tongue": "Chinese / Malay",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [
		"ART",
		"CHINESE",
		"ENGLISH LANGUAGE",
		"MALAY",
		"MATHEMATICS",
		"MUSIC",
		"PHYSICAL EDUCATION",
		"SOCIAL STUDIES"
	],
	"Cca": {},
	"SpecialProgrammes": {
		"MOE Programmes": [
			"Not Available"
		],
		"School Distinctive Programmes": {
			"Community Service & Student Leadership": "Lead with a Heart@Oasis"
		},
		"Special Student Development Programmes Offered": "1) The Leader in Me Programme"
	},
	"AchievementHistory": {
		"Primary": {
			"2005": {},
			"2006": {},
			"2007": {},
			"2008": {},
			"2009": {},
			"2010": {},
			"2011": {},
			"2012": {},
			"2013": {},
			"2014": {},
			"2015": {},
			"2016": {},
			"2017": {},
			"2018": {
				"SYF Arts Presentation": {
					"Dance - International": "Accomplishment"
				}
			}
		}
	},
	"postalCode": "828716"
}