{
	"code": "1272",
	"name": "FERN GREEN PRIMARY SCHOOL",
	"levels": "P",
	"uen": " T17GS0004L",
	"logo": "./Medias/Images/Schools/logos/tn_1272.jpg",
	"website": "http://www.ferngreenpri.moe.edu.sg",
	"address": "70, Fernvale Link ( 797538 )",
	"telephone": [
		"68343100"
	],
	"fax": [
		"68343116"
	],
	"email": "ferngreen_ps@moe.edu.sg",
	"mrt": "Kupang LRT Station (SW3)",
	"bus": "85 , 102 ",
	"GeneralInformation": {
		"Principal": "MRS TANG- CHIM LEE MAI",
		"Vice Principal": "MR SEE KOK KIONG",
		"School Philosophy, Culture and Ethos": [
			"Fern Green Primary School is designed as a school within a garden. Sited within an oasis of greenery, the school environment beckons Students into its fold to partake in exciting learning activities that are in store for all learners.",
			"The school believes that effective learning takes place when learner needs drive lesson designs. We believe that each child is active and inquisitive and wants to explore. As our children make the transition from kindergarten, we would like to keep their innate curiosity alive and nurture them into well-rounded, passionate, and curious lifelong learners.",
			"Our instructional approaches begin with Inquiry. Through the use of thought-provoking questions, we would like to spark our students' curiosity and inspire in them a genuine need to learn so that they care about the outcome of their investigations. Underpinning the design of Fern Green's academic curriculum and co-curriculum is our school values of Respect, Responsibility, Resilience, Integrity, Care and Harmony.",
			"The school would leverage School-Home-Community Partnership to avail our children of a holistic learning experience. We hope to work closely with Parents to reinforce values taught as well as foster our children's motivation to learn and ask questions, and encourage them to pursue what they love."
		],
		"Type of School": "GOVERNMENT SCHOOL / CO-ED SCHOOL / SINGLE SESSION",
		"Mother Tongue": "Chinese / Malay",
		"Affiliated Schools": "Not Applicable"
	},
	"SubjectOffered": [
		"ART",
		"CHINESE",
		"ENGLISH LANGUAGE",
		"MALAY",
		"MATHEMATICS",
		"MUSIC",
		"PHYSICAL EDUCATION",
		"SOCIAL STUDIES"
	],
	"Cca": {},
	"SpecialProgrammes": {
		"MOE Programmes": [
			"Not Available"
		],
		"Special Student Development Programmes Offered": "Not Available"
	},
	"AchievementHistory": {
		"Primary": {
			"2005": {},
			"2006": {},
			"2007": {},
			"2008": {},
			"2009": {},
			"2010": {},
			"2011": {},
			"2012": {},
			"2013": {},
			"2014": {},
			"2015": {},
			"2016": {},
			"2017": {},
			"2018": {}
		}
	},
	"postalCode": "797538"
}